Autodesk.Revit.DB.ShapeImporter.SetDefaultLengthUnit(Autodesk.Revit.DB.ImportUnit)
Sets the length unit to be used when the input is a unitless SAT file.
Remarks:
Values ImportUnit::Default and ImportUnit::Custom are ignored. ImportUnit::Centimeter is used instead.
defaultLengthUnit:
The length unit to be used for when the input is a unitless SAT file.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2017_subscription_update

Autodesk.Revit.DB.ShapeImporter.Convert(Autodesk.Revit.DB.Document,System.String)
Converts the geometry stored in the external format into a collection of Revit geometry objects.
document:
The Revit document where the resulting Revit geometry objects will be used. This document may need to be modified
to store dependent elements such as graphics styles and/or materials.
filename:
The full path to the input file.
Returns:
A collection of Revit geometry objects created from the incoming data.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The given filename does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Data conversion service is not available.
Since:
2017

Autodesk.Revit.DB.ShapeImporter.DefaultLengthUnit
The length unit to be used if not specified when the input is a unitless SAT file.
Remarks:
If the input is a unitless SAT file then this length unit will be used as a backup.
Since:
2017

Autodesk.Revit.DB.ShapeImporter.#ctor
Default constructor. Initializes an instance of ShapeImporter that will automatically recognize the file format from its extension (ShapeImporterSourceFormat.Auto).
Since:
2017

Autodesk.Revit.DB.ShapeImporter
A utility class that supports conversion of geometry stored in an external format into a Revit geometry objects.
Remarks:
See Autodesk.Revit.DB.ShapeImporterSourceFormat for the list of supported formats.
Since:
2017